In [1]:
# https://github.com/chesterheng/machinelearning-datascience --> link for notes
import sys
!{sys.executable} -m pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /home/anuj/.local/lib/python3.10/site-packages (1.4.1)
Requirement already satisfied: numpy>=1.21.0 in /usr/lib/python3.10/site-packages (from pandas) (1.22.2)
Requirement already satisfied: pytz>=2020.1 in /home/anuj/.local/lib/python3.10/site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in /usr/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
!{sys.executable} -m pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in /usr/lib/python3.10/site-packages (1.22.2)

In [3]:
import numpy as np

In [4]:
import pandas as pd

In [9]:
name=pd.Series(['anuj','akash','ashish'])
colour=pd.Series(['red','green','blue'])
print(colour)
print(name)

0      red
1    green
2     blue
dtype: object
0      anuj
1     akash
2    ashish
dtype: object

In [34]:
df=pd.DataFrame({'name':name,'colour':colour})
df

     name colour
0    anuj    red
1   akash  green
2  ashish   blue

In [12]:
import os
os.listdir()

['.ipynb_checkpoints',
 'Pandas-data-analysis .ipynb',
 'ex.csv',
 'pandas_exercises.ipynb',
 '_pratice.ipynb',
 'car-sales.csv',
 'car-sales-missing-data.csv']

In [15]:
car_sales_df = pd.read_csv('car-sales.csv')
car_sales_df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [16]:
car_sales_df.to_csv('export_car_sales.csv')

In [17]:
os.listdir()

['.ipynb_checkpoints',
 'Pandas-data-analysis .ipynb',
 'ex.csv',
 'pandas_exercises.ipynb',
 '_pratice.ipynb',
 'car-sales.csv',
 'car-sales-missing-data.csv',
 'export_car_sales.csv']

### Describing data with pandas

* attributes --> without () eg: dtypes,columns,index
* function --> with () eg- mean(),sum(),describe(),info()

In [20]:
car_sales_col=car_sales_df.columns
car_sales_index=car_sales_df.index
car_sales_index

RangeIndex(start=0, stop=10, step=1)

In [25]:
car_sales_df.describe()  #statistics of data

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [26]:
car_sales_df.info() # info on each col.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [27]:
car_sales_df.mean()

/tmp/ipykernel_5386/3029920428.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_sales_df.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [28]:
car_sales_df.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

## Viewing and selecting data-frame

* **.loc[[row],[col]]** --> shows by the index name
* **.iloc[[row],[col]]** --> shows by the position

In [29]:
car_sales_df.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [30]:
car_sales_df.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [31]:
os.listdir()

['.ipynb_checkpoints',
 'Pandas-data-analysis .ipynb',
 'ex.csv',
 'pandas_exercises.ipynb',
 '_pratice.ipynb',
 'car-sales.csv',
 'car-sales-missing-data.csv',
 'export_car_sales.csv']

In [35]:
series1=pd.Series(['anuj','akash','ashish','abhishek'],index=[15,25,2,7])
series1

15        anuj
25       akash
2       ashish
7     abhishek
dtype: object

In [36]:
series1.loc[25]

'akash'

In [37]:
series1.loc[:2] # starts from begining to given number.

15      anuj
25     akash
2     ashish
dtype: object

In [38]:
series1.loc[2:]

2      ashish
7    abhishek
dtype: object

In [43]:
car_sales_df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [44]:
car_sales_df.loc[:5,['Make','Colour']]

     Make Colour
0  Toyota  White
1   Honda    Red
2  Toyota   Blue
3     BMW  Black
4  Nissan  White
5  Toyota  Green

In [45]:
series1.iloc[1] # position 1

'akash'

In [49]:
car_sales_df.iloc[:7,0] # here it take the position 0-> col :7-> 0 to 7(inclusive)

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
Name: Make, dtype: object

In [51]:
car_sales_df.loc[car_sales_df.Make=='Toyota'] #csv with make == toyota

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00